[
  {
    "reviewer": {
      "response_id": "1hDHlfO0",
      "first_name": "Brenda",
      "last_name": "Kirby",
      "email": "brenda.kirby@greentophuntfish.com",
      "completion_time": "Mar 07, 2024 04:51:07 AM",
      "time_taken": "9 mins 2 secs "
    },
    "course_name": "AIHR",
    "module_name": "Module 1",
    "rating": 4,
    "positive_comments": "The narrator's voice is great. The amount of animation in the video is just enough to keep it interesting. The introduction prepares us for what we will be learning.",
    "improvement_opportunities": "The narrator is distracting. He just stood there and I found myself looking at his moustache too much of the time. I was watching him so much that I had to go back and review the video again. When I walked away and let the video play, I was able to focus on the content.  I don't think his physical appearance needs to be part of the video. His voice is great.",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "Mar 07, 2024 04:51:07 AM"
  },
  {
    "reviewer": {
      "response_id": "4OCzZpXc",
      "first_name": "Selen",
      "last_name": "Turner",
      "email": "selenturner@comcast.net",
      "completion_time": "Oct 17, 2023 01:29:25 PM",
      "time_taken": "1 hr 17 mins 39 secs "
    },
    "course_name": "AIHR",
    "module_name": "Module 1",
    "rating": 4,
    "positive_comments": "Overall the chapter provides a solid foundation. A few highlights:  - The flow of the chapter is well organized - The mix of discussion, lecture and articles is well designed.",
    "improvement_opportunities": "- More up to date information: The chapter should be written in present tense. There are several places that it is written in future tense.  AI is used in most HR Article choice: https://www.analyticssteps.com/blogs/what-role-ai-human-resource-management This article is written in 2021. I would like to suggest to utilize articles within 1 or 2 years for an ever changing topic like AI. The article also had outdated information and several grammar mistakes. I would replace with a more credible source.  https://www.oracle.com/a/ocom/docs/applications/hcm/oracle-ai-in-hr-wp.pdf This pdf is from 2019 and has statistics in it that probably changed drastically since then. I would suggest to find more up to date information on these great stats.  - Include Generative AI: In addition to Chat GPT , I would recommend to include Generative AI and its use within HR which is most recent and evolving more than the decade old Chat GPT.",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "Oct 17, 2023 01:29:25 PM"
  }
]