[
  {
    "reviewer": {
      "response_id": "T9BqXP4t",
      "first_name": "Pavan",
      "last_name": "Bakshi",
      "email": "pavan@pmconsulting.in",
      "completion_time": "May 03, 2024 11:32:47 PM",
      "time_taken": "15 mins 43 secs "
    },
    "course_name": "Review Team University of San Francisco - Women in Leadership Program + Ultimate Toolkit 2024",
    "module_name": "Module 1",
    "rating": 4,
    "positive_comments": "The module covers a comprehensive view of Women Leadership.",
    "improvement_opportunities": "The Slides are cluttered with too many words and sentences.  Various points on slides should come as bullet points one by one, or else the learner gets busy reading other points which are not being talked about.  In Pillar 1 of 17 presentation. Instead of Successful Qualities of Women leaders , the heading could be Communication Styles of Successful Women Leaders In Pillar 3 of 17 Presentation. The Slide heading across all slides are showing Confidence is the Key, it is suggested that it be 9 Pillars of Confident Women Leaders.   This point about the wardrobe is not covered in the presentation but is given as a key take away. Key Take-Aways Color and style influence a woman's personal feelings, performance, and projections. Wardrobe choices can shape perceptions of a woman as confident, impacting both her inner and outer strength. This also contributes to her presentation skills. In Pillar 8 of 17 Presentation. Names of Women leaders should be on each slide along with the photographs.",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "May 03, 2024 11:32:47 PM"
  },
  {
    "reviewer": {
      "response_id": "T9BqXP4t",
      "first_name": "Pavan",
      "last_name": "Bakshi",
      "email": "pavan@pmconsulting.in",
      "completion_time": "May 03, 2024 11:32:47 PM",
      "time_taken": "15 mins 43 secs "
    },
    "course_name": "Review Team University of San Francisco - Women in Leadership Program + Ultimate Toolkit 2024",
    "module_name": "Module 2",
    "rating": 4,
    "positive_comments": "Emotional Intelligence has been covered well.",
    "improvement_opportunities": "The Slides are cluttered with too many words and sentences. We could use diagrams/Images  for Emotional Intelligence as attached.  Various points on slides should come as bullet points one by one, or else the learner gets busy reading other points which are not being talked about.  In Intelligence  1 of 14 Presentation. There is a mismatch with the slides and what the speaker is saying in this video/presentation.  The content is not Women Leaders focused or presented as such. Some Study/Research/White paper/book  could be a basis of the content such as : https://hbr.org/2019/06/research-women-score-higher-than-men-in-most-leadership-skills or  https://www.routledge.com/go/the_transpersonal_leadership_white_paper_series_women_naturally_better_lead In Intelligence  3 of 14 Presentation. Connecting EI with movies may not be land since the participants may not have seen the movie.",
    "is_show_stopper": true,
    "show_stopper_details": "",
    "attachments": "Untitled design (1).png",
    "review_date": "May 03, 2024 11:32:47 PM"
  }
]