[
  {
    "reviewer": {
      "response_id": "KCD41Qjg",
      "first_name": "Katheryne",
      "last_name": "Walker",
      "email": "cao1walker@gmail.com",
      "completion_time": "Apr 24, 2024 01:21:13 PM",
      "time_taken": "24 mins 5 secs "
    },
    "course_name": "Transformative Leadership in Disruptive Times 1.0",
    "module_name": "Module 1",
    "rating": 4,
    "positive_comments": "The deep dive into AI and the qualities a well-equipped leader will need to be able assess and use the new technologies... a tool both in organizational management AND quality judgment calls when implementing. Heavy on the role and impact of AI in the world and workplace.",
    "improvement_opportunities": "I would address more intentionally what/why/how an event/world move classifies as disruptive AND I would separate out the transformational LEADER from transformational leadership... not just the what of what we do but the HOW of how we do it.   I am a big believer that the first course out of the gate sets the stage and level sets for all additional modules. So I'm approaching this analysis from that perspective. For instance, I would pull out Mandela and some of the others you address in Module 2 and discuss it a bit more upfront for level-setting.  I found it premature to immediately jump to AI without first setting the historical and personal stage. We need transformational leaders - because....? What models can we draw from when assessing our role in transformation? Context for their disruption.   After clarifying what we are solving for, then I would jump into the AI conversation.  I think it might tie Modules 1 and 2 together better so the two concepts follow a stream of thought.. and connect the PERSON of the moment to the disruptive moment itself.",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "Apr 24, 2024 01:21:13 PM"
  },
  {
    "reviewer": {
      "response_id": "KCD41Qjg",
      "first_name": "Katheryne",
      "last_name": "Walker",
      "email": "cao1walker@gmail.com",
      "completion_time": "Apr 24, 2024 01:21:13 PM",
      "time_taken": "24 mins 5 secs "
    },
    "course_name": "Transformative Leadership in Disruptive Times 1.0",
    "module_name": "Module 2",
    "rating": 5,
    "positive_comments": "Favorite module - focusing on the person and the impact of their \"humanness\" during times of disruption.  Love the Mandela story and docs, movie. I wouldn't change anything content-wise. WE are the variable, the \"x\" factor in any environment we find ourselves in so self-awareness, reflection, etc are paramount to surviving in this current work environment.",
    "improvement_opportunities": "As I mentioned for Module 1, I would perhaps evaluate scope and sequence of thought and content... where do they overlap and are there themes we are working to focus on throughout the course.   The only subtopic I would like to see more of is navigating and influencing from the almost middle... i.e. COOs, CFOs, etc.  How does the C-suite interact together and separately? How to influence the Boss (CEO or Board) towards positive outcomes that are measurable and inspirational.  Recalibrating the ethical conversation.",
    "is_show_stopper": false,
    "show_stopper_details": "",
    "attachments": NaN,
    "review_date": "Apr 24, 2024 01:21:13 PM"
  }
]