[
  {
    "reviewer": {
      "response_id": "y4BqQTad",
      "first_name": "Joyce",
      "last_name": "Bedell",
      "email": "joycebedell711@gmail.com",
      "completion_time": "Jul 16, 2024 01:50:50 PM",
      "time_taken": "11 mins 8 secs "
    },
    "course_name": "The Consulting Experience",
    "module_name": "Module 1",
    "rating": 3,
    "positive_comments": "The video lectures were well done and contained good information.",
    "improvement_opportunities": "It is confusing whether this program is meant to be done independently, or within a team and with a mentor.  There are references to attending workshops with peers, assigning roles within your team, and weekly meetings with a mentor.  It appears the program is a collaborative effort and not an independent, asynchronous course.  Whichever format is planned, it needs to be clearly stated to set student expectations of whether they will be working with a team and mentor, or working independently.",
    "is_show_stopper": true,
    "show_stopper_details": "Attachments are referenced that are not included in the course (e.g., assignment worksheets, student examples of completed assignments).",
    "attachments": "Consulting Experience - Module 1 Feedback.docx",
    "review_date": "Jul 16, 2024 01:50:50 PM"
  },
  {
    "reviewer": {
      "response_id": "y4BqQTad",
      "first_name": "Joyce",
      "last_name": "Bedell",
      "email": "joycebedell711@gmail.com",
      "completion_time": "Jul 16, 2024 01:50:50 PM",
      "time_taken": "11 mins 8 secs "
    },
    "course_name": "The Consulting Experience",
    "module_name": "Module 3",
    "rating": 5,
    "positive_comments": "Great module, full of good information.  The bullet points for project kickoff meetings, conducting meetings, and preparing for executive interviews provided excellent roadmaps for each step.",
    "improvement_opportunities": "Some of the referenced attachments/downloads are missing in the course (e.g., synthesis template, student examples).",
    "is_show_stopper": true,
    "show_stopper_details": "",
    "attachments": "Consulting Experience - Module 3 Feedback.docx",
    "review_date": "Jul 16, 2024 01:50:50 PM"
  },
  {
    "reviewer": {
      "response_id": "cYClR6mg",
      "first_name": "Britney",
      "last_name": "Beck",
      "email": "britney@hiwirehr.co",
      "completion_time": "Jul 05, 2024 10:40:15 AM",
      "time_taken": "1 hr 14 mins 45 secs "
    },
    "course_name": "The Consulting Experience",
    "module_name": "Module 2",
    "rating": 5,
    "positive_comments": "This module provides valuable information in a concise manner. It is easy to understand and the assignments provide great opportunities to practice.   The Quick Guide sets good expectations for the participant. I like it.   Assignment 1 is great practice in how to conduct research and analyze it in a way that helps the consultant better understand how they can help the client.   Questions for interviewing is a great resource and the example questions cover a broad spectrum of the client's business and operations. I like that this assignment asks the participant to draft additional questions related to the client as it gives them practice in asking specific questions based on their knowledge and research.   Assignment 2 is a great exercise.   Assignment 3 weekly call template is a great resource.",
    "improvement_opportunities": "The \"Week 2 Guide\" button does not work.   Questions for Interviewing - I think you could add to the instructions for the participant to use Assignment 1 as a reference in drafting questions specific to their client. Also, I'm not sure how this would work as a discussion question. It feels more like an assignment. So, maybe additional instructions for how to make it interactive with other participants, such as a requirement to leave feedback on one or two other participant's comments.   \"Student example of completed assignment\" link opens the same page and does not show an example.   Helpful Resources page is still the template page. Nothing related to this course is showing.",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "Jul 05, 2024 10:40:15 AM"
  },
  {
    "reviewer": {
      "response_id": "cYClR6mg",
      "first_name": "Britney",
      "last_name": "Beck",
      "email": "britney@hiwirehr.co",
      "completion_time": "Jul 05, 2024 10:40:15 AM",
      "time_taken": "1 hr 14 mins 45 secs "
    },
    "course_name": "The Consulting Experience",
    "module_name": "Module 3",
    "rating": 4,
    "positive_comments": "Video 1 provides great tips for handling the first client meeting. Overall the content is good. The majority of comments I have for this module will fall under opportunities, not because the content needs correcting, but because I think the organization of it can improve.",
    "improvement_opportunities": "It is clear that M3 builds on M2, and this is good. I think it would be helpful to the participant for the welcome to note this. Otherwise, it feels repetitive. My first thought was, \"Didn't we just go through this?\"  Specifically, I wonder if the Questions for Interviewing discussion question would be better suited as an assignment in M3. Also, I think the Data Analysis Research assignment would make more sense in M2, and then move the research assignment from M2 to M3.  Alternatively, if you kept the data analysis assignment in M3, I think it would be helpful to add to this assignment and have the participant reference their research from M2 so they can put the new knowledge about analysis into practice.   Video 2 - the first and second items shown were completed in M2. Again, this makes me wonder if M2 and M3 should have some reorganization. Also, the video ends abruptly. Is this an error?   The Discussion Question is confusing. It says to \"utilize your interview techniques...\" but interview techniques have not been covered yet. The second presentation was about conducting interviews, but I don't think there was enough about \"interview techniques\" to use this terminology in the assignment. Additionally, it says to \"use the provided synthesis template...\" but there is no template. Should that be a link in this section?   Assignment 2 instructs the participant to use notes from their interview role play. Two thoughts on this: 1) again, this makes me think the M2 assignments would be best in M3, and 2) if the assignments remain as is, I think it would be helpful for the participants if the instructions reference M2 such as, \"Use notes and recordings from the Interview Role Play assignment from Module 2.\"  \"Student example of completed assignment\" link opens the same page and does not show an example.   Helpful Resources page is still the template page. Nothing related to this course is showing.",
    "is_show_stopper": false,
    "show_stopper_details": "",
    "attachments": NaN,
    "review_date": "Jul 05, 2024 10:40:15 AM"
  }
]