[
  {
    "reviewer": {
      "response_id": "S9043uxe",
      "first_name": "KATHERYNE",
      "last_name": "WALKER",
      "email": "cao1walker@gmail.com",
      "completion_time": "May 17, 2024 11:15:36 AM",
      "time_taken": "14 mins 23 secs "
    },
    "course_name": "Transformative Leadership in Disruptive Times",
    "module_name": "Module 1",
    "rating": 5,
    "positive_comments": "I think the set-up for the course module is clear and straightforward.  Very nicely done!!",
    "improvement_opportunities": "If it fits with word count/time - I would try at the end to intentionally address the SWBAT for the module and its tie in to the next one so students track with the module outcomes/direction. A bit of spiral learning at the end ... nothing major at all. I never assume the audience is following my train of thought on why I am choosing to teach \"this\" vs \"that\". I continually circle back for connecting dots in data/choice of readings, etc.",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "May 17, 2024 11:15:36 AM"
  },
  {
    "reviewer": {
      "response_id": "S9043uxe",
      "first_name": "KATHERYNE",
      "last_name": "WALKER",
      "email": "cao1walker@gmail.com",
      "completion_time": "May 17, 2024 11:15:36 AM",
      "time_taken": "14 mins 23 secs "
    },
    "course_name": "Transformative Leadership in Disruptive Times",
    "module_name": "Module 2",
    "rating": 5,
    "positive_comments": "This is so well-done and love the choice of examples - you capture a wide variety of generations/industries AND their \"disruptions\" along with listing their successful transformational leadership traits.  Excellent excellent - don't be afraid to call out the courage and bravery required to stand up - and face the times with their many issues!!",
    "improvement_opportunities": "With Nelson - I would simply call out intentionally what made him transformational (bullet points) AND what the disruption was... nothing overdone but again, I think we assume people know what he did that was so amazing and out of step with his time!!  He was so brave - he took on so many heavy decisions.... and he persevered. An easy bullet point or two would work....transformational leader because... etc.",
    "is_show_stopper": false,
    "show_stopper_details": "",
    "attachments": NaN,
    "review_date": "May 17, 2024 11:15:36 AM"
  }
]