[
  {
    "reviewer": {
      "response_id": "iGCUuXl0",
      "first_name": "Diana",
      "last_name": "Lozano",
      "email": "dianalozano100@yahoo.com",
      "completion_time": "Apr 23, 2024 04:24:02 PM",
      "time_taken": "1 hr 48 mins 49 secs "
    },
    "course_name": "Transformative Leadership - Leading for the Future 1",
    "module_name": "Module 2",
    "rating": 3,
    "positive_comments": "Module Two covered ethics and values as it pertains to leadership. The first section discussed the use of power and influence by providing an overview of Nelson Mandela's life experiences that aided in shaping his leadership style. Module Two also covered common topics of transforming leaders and which actions can help develop leadership skills for positive change in the work environment. Module Two reminded students (professionals) how their leadership attributes and failures influence the workforce. These influences will be a lasting impression and become how the leader is known. It was good that the course reintroduced the significance of leadership ethics and values.",
    "improvement_opportunities": "I brought up ethics and values in the first box of the Course Reviewer Worksheet because students should understand the difference between ethics and moral values. These are two separate things that the professional should distinguish and learn how to apply both in the workplace and throughout their life journey. The course did not define these differences sufficiently before moving on to transforming the professional's leadership traits. Moral values will differ from one person to the next. However, ethics concerns principles, laws, regulations, and social standards. Professionals who recognize the difference can better build a personal brand, which becomes how people know them as leaders because they are ethical (comply with rules and policies) and hold themselves accountable to their moral values. All professionals are leaders; each person should build personal branding and understand its impact on well-being. Creating your own \"yellow umbrella\" is essential. The example of Nelson Mandela was not the best for today's modern leaders. I recall reading about Nelson Mandela in the course four years ago. Updating the course curriculum with current real-world examples should be completed annually.",
    "is_show_stopper": true,
    "show_stopper_details": "Introduce the legality of ethics vs. moral values. Discuss legal ethics and business ethics. Provide examples, real-world situations, and common ethical mishaps that continue today.",
    "attachments": NaN,
    "review_date": "Apr 23, 2024 04:24:02 PM"
  },
  {
    "reviewer": {
      "response_id": "iGCUuXl0",
      "first_name": "Diana",
      "last_name": "Lozano",
      "email": "dianalozano100@yahoo.com",
      "completion_time": "Apr 23, 2024 04:24:02 PM",
      "time_taken": "1 hr 48 mins 49 secs "
    },
    "course_name": "Transformative Leadership - Leading for the Future 1",
    "module_name": "Module 1",
    "rating": 3,
    "positive_comments": "I enjoyed reading about the history of leadership and how leadership traits and styles have evolved from rigid structures to building teams and partners between all classifications. This was a good introduction to the course. There is a mountain of research on leadership transformation and theories that intertwine with innate leadership vs learning through experience and education.  Is leadership a trait you are born with? Theoretically, no. I",
    "improvement_opportunities": "I would end Module One by having the students assess where they are now with their leadership strengths and weaknesses. Completing the behavioral assessment sets the stage for each student to consider the assessment outcome and which areas may be causing career setbacks. The professional can begin building a leadership framework to improve, self-regulate, and self-manage through soft skills development. Also, introducing the benefits of life coaching and providing a video lecture of a BetterUp coach providing real-world examples of creating a personal plan to achieve professional and personal life goals that impact each other.",
    "is_show_stopper": true,
    "show_stopper_details": "",
    "attachments": NaN,
    "review_date": "Apr 23, 2024 04:24:02 PM"
  }
]