[
  {
    "reviewer": {
      "response_id": "gg0SJoLH",
      "first_name": "Jen",
      "last_name": "Noborikawa",
      "email": "jen.noborikawa@gmail.com",
      "completion_time": "Apr 24, 2024 03:45:34 PM",
      "time_taken": "54 mins 28 secs "
    },
    "course_name": "Transformative Leadership Leading for the Future 1.0 and 2.0.",
    "module_name": "Module 6",
    "rating": 3,
    "positive_comments": "For Course 1.0:   There is a solid variety of well selected leadership qualities included in this module and the examples really help to make the qualities concrete.",
    "improvement_opportunities": "For Course 1.0:   - Video 2 Continuous Learning and Growth: The examples of the tech leaders featured in this video (Bezos, Sandberg, and Musk) may not be considered admirable leaders by some because of their business practices that have negatively affected democracies, wealth inequality, etc. I wonder if there are one or two other examples of leaders that demonstrate the qualities of continuous learning and growth that are less polarizing?   - Examples: I believe students would benefit from learning about a more diverse group of leaders.",
    "is_show_stopper": true,
    "show_stopper_details": "More diverse examples of leaders is needed to ensure that we aren't encouraging stereotypes of leaders with our students.",
    "attachments": NaN,
    "review_date": "Apr 24, 2024 03:45:34 PM"
  },
  {
    "reviewer": {
      "response_id": "gg0SJoLH",
      "first_name": "Jen",
      "last_name": "Noborikawa",
      "email": "jen.noborikawa@gmail.com",
      "completion_time": "Apr 24, 2024 03:45:34 PM",
      "time_taken": "54 mins 28 secs "
    },
    "course_name": "Transformative Leadership Leading for the Future 1.0 and 2.0.",
    "module_name": "Module 1",
    "rating": 4,
    "positive_comments": "For Course 2.0:   The breadth of this module really shows the numerous ways AI and transformative leadership can support cross-cultural needs and advances. If any student is new to these topics, it is a great first module to expand the horizons of their thinking about what’s possible.",
    "improvement_opportunities": "For Course 2.0:  It might be useful to briefly mention some of the potential pitfalls to be aware of when utilizing these approaches or allude to future modules where they will be discussed more fully, such as Module 3 on Ethical Leadership.",
    "is_show_stopper": false,
    "show_stopper_details": "",
    "attachments": NaN,
    "review_date": "Apr 24, 2024 03:45:34 PM"
  }
]