{
  "overview": {
    "total_reviews": 2,
    "average_rating": 4.5,
    "critical_issues": 2
  },
  "rating_distribution": {
    "5": 1,
    "4": 1
  },
  "modules": {
    "Module 1": {
      "average_rating": 4.5,
      "total_reviews": 2,
      "critical_issues": [
        {
          "reviewer": "Carolyn Colby",
          "issue": "Overall, this is an excellent module.  However, more information about consistent implementation of processes and procedure would be helpful.   Often, as humans, we find ourselves developing and brainstorming different ideas and concepts over an extended period of time.  However, the actual implementation of these thoughts and ideas are challenging, thus often never done.  To discuss concrete ways of implementation and a timeline to do so might be beneficial.",
          "details": "Planning and discussing but never using the process."
        },
        {
          "reviewer": "Carolyn Colby",
          "issue": "Focus a bit more on the evolving patient population. Patients at one time had a primary focus on a family physician where trust and caring were developed.   Today many patients see many different physicians and sometimes for a shorter period of time.   How can patients receive excellent care and understanding of their illnesses under this system.  Also, payment sources changing to overseeing and managing care sometimes forces patients to search online i.e. Google to enhance their knowledge of treatment and care.",
          "details": ""
        }
      ]
    }
  },
  "critical_issues": [
    {
      "module": "Module 1",
      "reviewer": "Carolyn Colby",
      "issue": "Overall, this is an excellent module.  However, more information about consistent implementation of processes and procedure would be helpful.   Often, as humans, we find ourselves developing and brain..."
    },
    {
      "module": "Module 1",
      "reviewer": "Carolyn Colby",
      "issue": "Focus a bit more on the evolving patient population. Patients at one time had a primary focus on a family physician where trust and caring were developed.   Today many patients see many different phys..."
    }
  ],
  "top_positive_themes": [],
  "improvement_areas": []
}