[
  {
    "reviewer": {
      "response_id": "OIClXY4D",
      "first_name": "Carolyn",
      "last_name": "Colby",
      "email": "carolyncolby@earthlink.net",
      "completion_time": "Jun 24, 2024 07:15:16 PM",
      "time_taken": "1 day 2 hrs 18 mins 46 secs "
    },
    "course_name": "Customer experience in Healthcare: Revolutionizing Pateint-Centric Care",
    "module_name": "Module 1",
    "rating": 5,
    "positive_comments": "First of all, this module is very interesting and accurate.  Many patients after Covid have various complaints about the inability of healthcare organizations to provides appropriate care effectively and efficiently.  An overview of customer experience from the beginning of care until the end including the billing process is exemplary.  Then understanding the importance of these total concepts including the challenges of being able to encourage dialogue with different departments would be very useful to enhance the patient experience.  Providers of care must realize that all departments are equal in importance in providing ultimate customer experience to excellent outcomes.  Utilization of case studies shows how using stated techniques in the real world will enhance customer experience which should encourage their use.",
    "improvement_opportunities": "Overall, this is an excellent module.  However, more information about consistent implementation of processes and procedure would be helpful.   Often, as humans, we find ourselves developing and brainstorming different ideas and concepts over an extended period of time.  However, the actual implementation of these thoughts and ideas are challenging, thus often never done.  To discuss concrete ways of implementation and a timeline to do so might be beneficial.",
    "is_show_stopper": true,
    "show_stopper_details": "Planning and discussing but never using the process.",
    "attachments": "Screenshot 2024-06-24 161730 1.png, Screenshot 2024-06-24 162109 2.png, Screenshot 2024-06-24 162322 3.png",
    "review_date": "Jun 24, 2024 07:15:16 PM"
  },
  {
    "reviewer": {
      "response_id": "OIClXY4D",
      "first_name": "Carolyn",
      "last_name": "Colby",
      "email": "carolyncolby@earthlink.net",
      "completion_time": "Jun 24, 2024 07:15:16 PM",
      "time_taken": "1 day 2 hrs 18 mins 46 secs "
    },
    "course_name": "Customer experience in Healthcare: Revolutionizing Pateint-Centric Care",
    "module_name": "Module 1",
    "rating": 4,
    "positive_comments": "This part of the module explains the importance of patients having a good experience when encountering the healthcare system.   It also amply discusses use of auxiliary items i.e., EHR, A.I., email and texts messaging to make the experience better for the patients.   Importantly it also discusses bringing the patients family into the equation to heighten the experience.  Comparing customer expectations with actual experience will allow medical facilities to retain their patients over the long run.",
    "improvement_opportunities": "Focus a bit more on the evolving patient population. Patients at one time had a primary focus on a family physician where trust and caring were developed.   Today many patients see many different physicians and sometimes for a shorter period of time.   How can patients receive excellent care and understanding of their illnesses under this system.  Also, payment sources changing to overseeing and managing care sometimes forces patients to search online i.e. Google to enhance their knowledge of treatment and care.",
    "is_show_stopper": true,
    "show_stopper_details": "",
    "attachments": "Screenshot 2024-06-24 171053 4.png, Screenshot 2024-06-24 171200 5.png, Screenshot 2024-06-24 171310 6.png",
    "review_date": "Jun 24, 2024 07:15:16 PM"
  }
]