[
  {
    "reviewer": {
      "response_id": "VC0cKLdV",
      "first_name": "Tasvir",
      "last_name": "Hasan",
      "email": "Tashas1037@gmail.com",
      "completion_time": "Dec 17, 2023 04:03:56 PM",
      "time_taken": "3 mins 55 secs "
    },
    "course_name": "CX2.0",
    "module_name": "Module 5",
    "rating": 4,
    "positive_comments": "•\tSection 1 of 11: Good practical example of why CX is an important focus in video; mentioning that companies that do it outperform competitors in terms of revenue, customer loyalty, and customer differentiation, etc.  •\tSection 3 of 11: I think the examples in the beginning (around minute 1) are great and help students anticipate key points and what to pay attention to (gives structure).  I trust this will be a consistent theme throughout the rest of the module videos, and if not, we should try to mirror this as it’s quite effective.  Specific examples under each item subsequently was also a great way to hit the points (hit the nails on the head  ) •\tSection 3 of 11:  Really great recap at the end revisiting the main points in a one pager. •\tSection 6 of 11: Great comment on customizing ROI to your organization!  Very relevant.  Great examples with the different companies as well.  •\tSection 8 of 11: Great question posed here!  •\tSection 10 of 11: Very helpful planner given…",
    "improvement_opportunities": "•\tSection 1 of 11: When KPI’s are mentioned, it would be good to spell that out and also give context /explanations for non-subject matter experts. •\tSection 2 of 11: I like the question posed, but can we also ask to give real life experiences they have gone through, and lessons learned, etc.? •\tSection 2 of 11: Was the following supposed to be a hyperlink: “Article from CX University”.  The placement makes me anticipate a hyperlink. Was it in relation to the article in the preceding bullet point?  •\tSection 3 of 11: Specific examples of how CX has improved Revenue etc would be good.  To say it helps Revenue is a start, but to say it has shown to increase Revenue by 10% etc vs cost of 2% etc. would give good context on cost benefit analysis (e.g. incremental benefit of 8%). •\tSection 3 of 11: I think net income is more common and understood than Net Return in ROI calcs (at least in the US). Showing an example that Net income is revenue from program minus program expenses would seem beneficial in my opinion.  Or showing the calcs to get to net returns may also get the same point across. •\tSection 4 of 11:  Giving SWOT analysis in the qualitative measurables may be good to give some context in the summary paragraph. •\tSection 4 of 11: the question posed is good, but can we also ask to give real life experiences they have gone through, and lessons learned, etc.? •\t Section 5 of 11: If no copyright / infringement issues, can we incorporate the customer service metrics calculator from the article in section 4 of 11 as part of this assignment?  Perhaps it may get too complicated doing it, but just an idea… •\tSection 7 of 11: Giving some potential examples of common Goals and Objectives would be helpful here via a dropdown or just notes.  If dropdown, allow Other with Text to be added options… •\tSection 9 of 11: Blank, I suppose TBU? Questions related to calculations would be suggested here to make them better stick to users memory…",
    "is_show_stopper": true,
    "show_stopper_details": "•\tSection 9 of 11: Blank, I suppose TBU? Questions related to calculations would be suggested here to make them better stick to users memory…  Other comments: •\tSection 1 of 11: Good that Forrester’s Customer Experience Index was mentioned.   o\tQuestion: does it give the appropriate level of details /info subsequently?  •\tSection 1 of 11: In Conclusion Section; question: were there enough examples in the video?  How about the recap? •\tSection 2 of 11: Another article worth considering if no copyright or other challenges w/ linking to other resources: https://www.salesforce.com/resources/articles/customer-service-training/ \t •\tSection 2 of 11: Are we affiliated with CXUniversity?  If not, do we need permission and should we connect w/ them via an affiliate program for referrals?  Can work in both directions’ w/ revenue share agreements?",
    "attachments": "Feedback document_Mod 5_v2.docx",
    "review_date": "Dec 17, 2023 04:03:56 PM"
  },
  {
    "reviewer": {
      "response_id": "VC0cKLdV",
      "first_name": "Tasvir",
      "last_name": "Hasan",
      "email": "Tashas1037@gmail.com",
      "completion_time": "Dec 17, 2023 04:03:56 PM",
      "time_taken": "3 mins 55 secs "
    },
    "course_name": "CX2.0",
    "module_name": "Module 6",
    "rating": 4,
    "positive_comments": "•\tIntro: Very good intro with relevant outline, tangible points, examples e.g. McKinsey’s stats, Airbnb example, and conclusion •\tSection 3 of 12:   o\tgood use of stats and explaining why inclusion is also important on top of diversity.   o\tA great point about employees leaving when they feel there isn’t enough diversity; moreover, financial impact on having to retrain and errors from consistently having new people.   o\tAlso, it is good to address microaggression in the workplace, which is a related point on lack of diversity.  o\tGreat to point out impact on bottom line and cash flow, which is what will non diverse people pay attention to diversity if no other genuine care.  •\tSection 4 of 12:   Good article and it inherently makes a bigger impact to have the author be a diverse one given the topic •\tSection 6 of 12:   o\tGreat outline on page; moreover, great video inclusive of chart on areas of planning on video at around 4:30 of 15:07.   o\tIt should be noted subsequently in conclusion, and questions in section 10 etc., if not already there.   o\tGood reinforcement of stats about better engagement and performance at work when there is more diversity and inclusion.   o\tNice comment about assigning a DE&I leader, which I have seen provides value and accountability. •\tSection 8 of 12:   Really appreciate all the relevant examples such as dominoes, etc.  All other modules should be like this.",
    "improvement_opportunities": "•\tIntro: I found it ironic when this section on diversity had the most non diverse instructor (white male) you can have in most corporate workplaces.  I don’t mean to sound cynical, but I probably wouldn’t be the only person to think this. I think we may lose some credibility here, especially when we had a woman instruct module 5 (I was expecting her or another diverse person for the diversity module).  We used to get this type of feedback in different HR related training courses at my former company, so wanted to provide that reference point as well for context. Although, I must say the instructor was effective.  I personally believe we should have the best person fill the role even though it may not appear like it at face value i.e. white male talking about diversity; however, when it’s a diversity section, I think this is a bit too much to ignore/overlook.  The presenter even mentions this in section 8 of 12 in terms of effective marketing by showing diversity in materials, etc.  •\tSection 2 of 12:  Similar comments to intro.  Although it is a good article, it may be more impactful to choose articles on diversity where the author is diverse, even if it is for optics.   o\tOr give article or report from McKinsey, which was referenced before, such as this one: https://www.mckinsey.com/featured-insights/diversity-and-inclusion/diversity-matters-even-more-the-case-for-holistic-impact  •\tSection 5 of 12:  Good questions, but I wonder if adding a more direct question to ask people to reflect on an experience when non diversity and inclusiveness led to some challenges, and reflections and opportunities for improvement, etc.   •\tSection 7 of 12:  I think the score needs some context or a reference point by giving some more information on NPS, or CSAT, or CES., and/or at least should be at the bottom after the question what success looks like.   •\tSection 9 of 12: link to article wasn’t working when I tried to launch… •\tSection 10 of 12: no questions loaded for review…   •\tSection 11 of 12: same planner as in section 5? Repeated?  Intentional?    •\tSection 12 of 12: no hyperlink for course review. TBU?",
    "is_show_stopper": true,
    "show_stopper_details": "",
    "attachments": "Feedback document_Mod 6_V4.docx",
    "review_date": "Dec 17, 2023 04:03:56 PM"
  }
]