[
  {
    "reviewer": {
      "response_id": "GuBq7vM9",
      "first_name": "Michael",
      "last_name": "Vetri",
      "email": "mikevetri18@gmail.com",
      "completion_time": "Aug 22, 2024 02:37:13 PM",
      "time_taken": "1 hr 23 mins 43 secs "
    },
    "course_name": "IT and Cybersecurity Leadership",
    "module_name": "Module 1",
    "rating": 3,
    "positive_comments": "- Great first discussion questions about continuous learning and keeping up with threat landscape. Probably worth mentioning that these two combined ensure that leaders and teams stay ahead of the competition, the competition being the adversary - \"Improving your leadership skills\" worksheet: Great on #1 - it requires an immense amount of self-regulation and self-awareness to understand one's strengths and weaknesses in how to lead, and thus what type of scenarios where one may struggle. For example, an introverted leader may struggle in a high-tempo environment with a lot of information flow and communications needed -- \"Develop a clear vision\" - while this is great, this should be focused on in greater detail. A vision statement is not enough for developing this vision, but a roadmap to get there, lines of effort, and objectives to be accomplished that will confidently prove that the vision has been achieved.",
    "improvement_opportunities": "- Democratic leadership has its appropriate context, but is not applicable everywhere. Inclusivity and Transparency is important. However, there in environments that are more high-tempo, such as incident response, there should be a respected chain of command / chain of authority to make sure that an experienced leader continues to make the tough decisions as the situation evolves. - Need to capture what transformational leadership is, before giving a long example of Bill Gates and Microsoft. It's not just inspiring and motivating, it is also about having a vision and purpose for the entire team to drive them towards a desired end state, and having the power of influence not by expertise or experience, but by a presence of command and sacrifice for the team that will want them to work for their leader.  Also being well-versed in emotional intelligence has proven that earnings are typically exceeded by 20% of their goal compared to those orgs that are not well-versed in it. There are other styles of leadership, such as: -- Contingent reward: rewarding folks on great performance (transactional) -- Active Management By Exception (MBE): basically micromanaging, always looking for deviations -- Passive MBE: Only engages when something is wrong -- Transformational: Charisma (strong vision, instills pride, builds trust), Inspiration Motivation (motivates former non-followers), Intellectual stimulation (challenges old ways, common in Six Sigma leaders), and individual consideration (visible to team, gives individual attention, coaches, advises, sustains motivation) - Video 1 and Video 2 both talk about attributes of a leader, but those attributes are different. This does offer a bit of inconsistency - Video 2 talks about managers and leaders interchangably. However, they are not the same. All leaders are managers, but not all managers are leaders. Managers will manage resources (time, money, staffing, equipment) and execute the mission, but leaders do that as well as coach, advise, train, develop, and improve the team. - \"Coaches are your friend\" - quote from video 2. I'd disagree. Coaches push and motivate you, but to imply managers can be an employee's \"friend\" implies a possibility for unprofessional relationships - The 1st assignment asks students to describe where a leadership style may be effective. I'd recommend in the previous block to at least offer criteria for situations where each leadership style is effective. For example, a commanding style is most effective in high-tempo, high-stress environments. An example would be during incident response, when a team must rectify a computer emergency fast to save the company. That is not the time for coaching, obviously, or democratic leadership. - Another disadvantage to functional reporting is that it costs the company money to pay those managers. Leaner companies with multi-talented managers can perform more efficiently if leveraging a \"team lead\" concept - Assignment 2 should have a longer scope for what the leader can do to implement positive results, beyond just 3 days. Maybe take a 30-60-90 approach. It's hard to stay focused after a 3-day exercise. It's probably not long enough to truly gauge if what you've strategized will be longterm and enduring",
    "is_show_stopper": false,
    "show_stopper_details": NaN,
    "attachments": NaN,
    "review_date": "Aug 22, 2024 02:37:13 PM"
  }
]