{
  "overview": {
    "total_reviews": 3,
    "average_rating": 3.0,
    "critical_issues": 2
  },
  "rating_distribution": {
    "3": 1,
    "2": 1,
    "4": 1
  },
  "modules": {
    "Module 2": {
      "average_rating": 3.0,
      "total_reviews": 1,
      "critical_issues": [
        {
          "reviewer": "Selen Turner",
          "issue": "Video's graphics are blurry which makes it hard to read. More visual representation can be added instead of the heavy written paragraphs that repeats what speaker already articulates. The videos also should have samples of the customer journey maps and other visual aid about the subject matter as the speaker talks about them. The knowledge check and feedback survey did not populate when clicked on  those sections.",
          "details": "The blurry look of the video graphics and heavy written language that repeats the speaker makes the course look outdated."
        }
      ]
    },
    "Capstone": {
      "average_rating": 2.0,
      "total_reviews": 1,
      "critical_issues": [
        {
          "reviewer": "Selen Turner",
          "issue": "The design should be clearer with blank spaces, fillable spaces and editable version to be able to modify to fit the needs. There could be two versions. One is the comprehensive document and the other one is the editable and customizable shorter more practical version.",
          "details": ""
        }
      ]
    },
    "Module 4": {
      "average_rating": 4.0,
      "total_reviews": 1,
      "critical_issues": []
    }
  },
  "critical_issues": [
    {
      "module": "Module 2",
      "reviewer": "Selen Turner",
      "issue": "Video's graphics are blurry which makes it hard to read. More visual representation can be added instead of the heavy written paragraphs that repeats what speaker already articulates. The videos also ..."
    },
    {
      "module": "Capstone",
      "reviewer": "Selen Turner",
      "issue": "The design should be clearer with blank spaces, fillable spaces and editable version to be able to modify to fit the needs. There could be two versions. One is the comprehensive document and the other..."
    }
  ],
  "top_positive_themes": [],
  "improvement_areas": []
}